In [1]:
import numpy as np
import pandas as pd

# DataFrames

In [2]:
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [3]:
lists=['Learning','Day', '2','DataFrames']
print(pd.DataFrame(lists))

            0
0    Learning
1         Day
2           2
3  DataFrames

In [4]:
dataa={'Name':['Alin','Binod','Anjal','Srijana'], 'Age':[1,2,3,4]}
df=pd.DataFrame(dataa)
print(df)

      Name  Age
0     Alin    1
1    Binod    2
2    Anjal    3
3  Srijana    4

Series:

In [5]:
ser=pd.Series()
print(ser)

Series([], dtype: object)

In [6]:
d=np.array(['g','a','f','b'])
print(pd.Series(d))

0    g
1    a
2    f
3    b
dtype: object

In [7]:
age=pd.Series([20,30,40],index=['Alin','Srijana','Anjal'])
print(age)

Alin       20
Srijana    30
Anjal      40
dtype: int64

# Reading Csv Files

In [13]:
df = pd.read_csv("people_data.csv")
print(df)
print('\n')
#print(df.head(2))
print('\n')
#print(df.tail(2))
print('\n')
#print(df.info())
df.info(verbose=False, null_counts=False)

  First Name Last Name     Sex                       Email Date of birth
0     Shelby   Terrell    Male        elijah57@example.net    1945-10-26
1    Phillip   Summers  Female       bethany14@example.com    1910-03-24
2   Kristine    Travis    Male       bthompson@example.com    1992-07-02
3    Yesenia  Martinez    Male   kaitlinkaiser@example.com    2017-08-03
4       Lori      Todd    Male  buchananmanuel@example.net    1938-12-01






<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Columns: 5 entries, First Name to Date of birth
dtypes: object(5)
memory usage: 332.0+ bytes

In [9]:

display(df)

  First Name Last Name     Sex                       Email Date of birth
0     Shelby   Terrell    Male        elijah57@example.net    1945-10-26
1    Phillip   Summers  Female       bethany14@example.com    1910-03-24
2   Kristine    Travis    Male       bthompson@example.com    1992-07-02
3    Yesenia  Martinez    Male   kaitlinkaiser@example.com    2017-08-03
4       Lori      Todd    Male  buchananmanuel@example.net    1938-12-01

In [10]:
display(df.describe())

       First Name Last Name   Sex                 Email Date of birth
count           5         5     5                     5             5
unique          5         5     2                     5             5
top        Shelby   Terrell  Male  elijah57@example.net    1945-10-26
freq            1         1     4                     1             1

In [14]:
#check null data
df.isnull()
df.isnull().sum() # total number of null data gives of column

#for row
for i in range(len(df.index):
    print(i+1,":", df.iloc[i].isnull().sum())

# loc and iloc

In [20]:
# loc requires end index

loc_r=df.loc[0,'Sex'] # row-0 and col-Sex
print(loc_r)

iloc_r=df.iloc[1,2] #row-1 col-2
print(iloc_r)

only_iloc=df.iloc[1]
print(only_iloc)


#multiple rowss
print("\n")
print(df.loc[[0,2]])
print(df.iloc[[1,3]])

Male
Female
First Name                     Phillip
Last Name                      Summers
Sex                             Female
Email            bethany14@example.com
Date of birth               1910-03-24
Name: 1, dtype: object


  First Name Last Name   Sex                  Email Date of birth
0     Shelby   Terrell  Male   elijah57@example.net    1945-10-26
2   Kristine    Travis  Male  bthompson@example.com    1992-07-02
  First Name Last Name     Sex                      Email Date of birth
1    Phillip   Summers  Female      bethany14@example.com    1910-03-24
3    Yesenia  Martinez    Male  kaitlinkaiser@example.com    2017-08-03

# Slicing Data

In [21]:
player_list = [['M.S.Dhoni', 36, 75, 5428000],
               ['A.B.D Villers', 38, 74, 3428000],
               ['V.Kohli', 31, 70, 8428000],
               ['S.Smith', 34, 80, 4428000],
               ['C.Gayle', 40, 100, 4528000],
               ['J.Root', 33, 72, 7028000],
               ['K.Peterson', 42, 85, 2528000]]
df = pd.DataFrame(player_list, columns=['Name', 'Age', 'Weight', 'Salary'])
display(df)

            Name  Age  Weight   Salary
0      M.S.Dhoni   36      75  5428000
1  A.B.D Villers   38      74  3428000
2        V.Kohli   31      70  8428000
3        S.Smith   34      80  4428000
4        C.Gayle   40     100  4528000
5         J.Root   33      72  7028000
6     K.Peterson   42      85  2528000

In [26]:
#slicing row
df1=df.iloc[0:4]
display(df1)
print("\n")

#slicing column
df2=df.iloc[:,0:2]
print(df2)

            Name  Age  Weight   Salary
0      M.S.Dhoni   36      75  5428000
1  A.B.D Villers   38      74  3428000
2        V.Kohli   31      70  8428000
3        S.Smith   34      80  4428000

            Name  Age
0      M.S.Dhoni   36
1  A.B.D Villers   38
2        V.Kohli   31
3        S.Smith   34
4        C.Gayle   40
5         J.Root   33
6     K.Peterson   42

In [30]:
#filtering the data
filtered_data=df.loc[df['Age']>35]
display(filtered_data)

            Name  Age  Weight   Salary
0      M.S.Dhoni   36      75  5428000
1  A.B.D Villers   38      74  3428000
4        C.Gayle   40     100  4528000
6     K.Peterson   42      85  2528000